RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_rcc.c
  sysclk_source = __HAL_RCC_GET_SYSCLK_SOURCE();
  pllsource = __HAL_RCC_GET_PLL_OSCSOURCE();

  if ((sysclk_source == RCC_SYSCLKSOURCE_STATUS_MSI) ||
      ((sysclk_source == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && (pllsource == RCC_PLLSOURCE_MSI)))
  {
    /* MSI or PLL with MSI source used as system clock source */
    /*Retrieve MSI frequency range in HZ*/
    msifreq = __LL_RCC_CALC_MSI_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                     ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                      LL_RCC_MSI_GetRange() :
                                      LL_RCC_MSI_GetRangeAfterStandby()));

    /* Get SYSCLK source */
    if (sysclk_source == RCC_SYSCLKSOURCE_STATUS_MSI)
    {
      /* MSI used as system clock source */
      sysclockfreq = msifreq;
    }
  }
  else if (sysclk_source == RCC_SYSCLKSOURCE_STATUS_HSI)
  {
    /* HSI used as system clock source */
    sysclockfreq = HSI_VALUE;
  }
  else if (sysclk_source == RCC_SYSCLKSOURCE_STATUS_HSE)
  {
    /* HSE used as system clock source */
    if (LL_RCC_HSE_IsEnabledDiv2() == 1U)
    {
      sysclockfreq = HSE_VALUE / 2U;
    }
    else
    {
      sysclockfreq = HSE_VALUE;
    }
  }
  else
  {
  }

  if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK)
  {
    /* PLL used as system clock  source */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
      case RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
        pllinputfreq = HSI_VALUE;
        break;
      case RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        if (LL_RCC_HSE_IsEnabledDiv2() == 1U)
        {
          pllinputfreq = HSE_VALUE / 2U;
        }
        else
        {
          pllinputfreq = HSE_VALUE;
        }
        break;
      case RCC_PLLSOURCE_MSI:  /* MSI used as PLL clock source */
      default:
        pllinputfreq = msifreq;
        break;
    }
    sysclockfreq = __LL_RCC_CALC_PLLCLK_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(), LL_RCC_PLL_GetN(), LL_RCC_PLL_GetR());
  }

  return sysclockfreq;
}

/**
  * @brief  Return the HCLK frequency.
  * @retval HCLK frequency in Hz
  */
uint32_t HAL_RCC_GetHCLKFreq(void)
{
  /* Get SysClock and Compute HCLK1 frequency --------------------------------*/
  return ((uint32_t)(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler())));
}

#if defined(DUAL_CORE)
/**
  * @brief  Return the HCLK2 frequency.
  * @retval HCLK2 frequency in Hz
  */
uint32_t HAL_RCC_GetHCLK2Freq(void)
{
  /* Get SysClock and Compute HCLK2 frequency --------------------------------*/
  return ((uint32_t)(__LL_RCC_CALC_HCLK2_FREQ(HAL_RCC_GetSysClockFreq(), LL_C2_RCC_GetAHBPrescaler())));
}
#endif

/**
  * @brief  Return the HCLK3 frequency.
  * @retval HCLK3 frequency in Hz
  */
uint32_t HAL_RCC_GetHCLK3Freq(void)
{
  /* Get SysClock and Compute AHB3 frequency ---------------------------------*/
  return ((uint32_t)(__LL_RCC_CALC_HCLK3_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHB3Prescaler())));
}

/**
  * @brief  Return the PCLK1 frequency.
  * @retval PCLK1 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK1Freq(void)
{
  /* Get HCLK source and Compute PCLK1 frequency -----------------------------*/
  return ((uint32_t)(__LL_RCC_CALC_PCLK1_FREQ(HAL_RCC_GetHCLKFreq(), LL_RCC_GetAPB1Prescaler())));
}

/**
  * @brief  Return the PCLK2 frequency.
  * @retval PCLK2 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK2Freq(void)
{
  /* Get HCLK source and Compute PCLK2 frequency -----------------------------*/
  return ((uint32_t)(__LL_RCC_CALC_PCLK2_FREQ(HAL_RCC_GetHCLKFreq(), LL_RCC_GetAPB2Prescaler())));
}

/**
  * @brief  Configure the RCC_OscInitStruct according to the internal
  *         RCC configuration registers.
  * @param  RCC_OscInitStruct  pointer to an RCC_OscInitTypeDef structure that
  *         will be configured.
  * @retval None
  */
void HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct)
{
  /* Check the parameters */
  if (RCC_OscInitStruct != NULL)
  {
    /* Set all possible values for the Oscillator type parameter ---------------*/
    RCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_MSI | \
                                        RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_LSI;


    /* Get the HSE configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_HSEBYPPWR) == RCC_CR_HSEBYPPWR)
    {
      RCC_OscInitStruct->HSEState = RCC_HSE_BYPASS_PWR;
    }
    else if ((RCC->CR & RCC_CR_HSEBYP) == RCC_CR_HSEBYP)
    {
      RCC_OscInitStruct->HSEState = RCC_HSE_BYPASS;
    }
    else if ((RCC->CR & RCC_CR_HSEON) == RCC_CR_HSEON)
    {
      RCC_OscInitStruct->HSEState = RCC_HSE_ON;
    }
    else
    {
      RCC_OscInitStruct->HSEState = RCC_HSE_OFF;
    }

    if ((RCC->CR & RCC_CR_HSEPRE) == RCC_CR_HSEPRE)
    {
      RCC_OscInitStruct->HSEDiv = RCC_HSE_DIV2;
    }
    else
    {
      RCC_OscInitStruct->HSEDiv = RCC_HSE_DIV1;
    }

    /* Get the MSI configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_MSION) == RCC_CR_MSION)
    {
      RCC_OscInitStruct->MSIState = RCC_MSI_ON;
    }
    else
    {
      RCC_OscInitStruct->MSIState = RCC_MSI_OFF;
    }
    RCC_OscInitStruct->MSICalibrationValue  = LL_RCC_MSI_GetCalibTrimming();
    RCC_OscInitStruct->MSIClockRange        = LL_RCC_MSI_GetRange();

    /* Get the HSI configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_HSION) == RCC_CR_HSION)
    {
      RCC_OscInitStruct->HSIState = RCC_HSI_ON;
    }
    else
    {
      RCC_OscInitStruct->HSIState = RCC_HSI_OFF;
    }

    RCC_OscInitStruct->HSICalibrationValue = LL_RCC_HSI_GetCalibTrimming();

    /* Get the LSE configuration -----------------------------------------------*/
    if ((RCC->BDCR & RCC_BDCR_LSEBYP) == RCC_BDCR_LSEBYP)
    {
      if ((RCC->BDCR & RCC_BDCR_LSESYSEN) == RCC_BDCR_LSESYSEN)
      {
        RCC_OscInitStruct->LSEState = RCC_LSE_BYPASS;
      }
      else
      {
        RCC_OscInitStruct->LSEState = RCC_LSE_BYPASS_RTC_ONLY;
      }
    }
    else if ((RCC->BDCR & RCC_BDCR_LSEON) == RCC_BDCR_LSEON)
    {
      if ((RCC->BDCR & RCC_BDCR_LSESYSEN) == RCC_BDCR_LSESYSEN)
      {
        RCC_OscInitStruct->LSEState = RCC_LSE_ON;
      }
      else
      {
        RCC_OscInitStruct->LSEState = RCC_LSE_ON_RTC_ONLY;
      }
    }
    else
    {
      RCC_OscInitStruct->LSEState = RCC_LSE_OFF;
    }

    /* Get the LSI configuration -----------------------------------------------*/
    if (((RCC->CSR & RCC_CSR_LSION) == RCC_CSR_LSION))
    {
      RCC_OscInitStruct->LSIState = RCC_LSI_ON;
    }
    else
    {
      RCC_OscInitStruct->LSIState = RCC_LSI_OFF;
    }

    if ((RCC->CSR & RCC_CSR_LSIPRE) == RCC_CSR_LSIPRE)
    {
      RCC_OscInitStruct->LSIDiv = RCC_LSI_DIV128;
    }
    else
    {
      RCC_OscInitStruct->LSIDiv = RCC_LSI_DIV1;
    }

    /* Get the PLL configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_PLLON) == RCC_CR_PLLON)
    {
      RCC_OscInitStruct->PLL.PLLState = RCC_PLL_ON;
    }
    else
    {
      RCC_OscInitStruct->PLL.PLLState = RCC_PLL_OFF;
    }
    RCC_OscInitStruct->PLL.PLLSource = LL_RCC_PLL_GetMainSource();
    RCC_OscInitStruct->PLL.PLLM      = LL_RCC_PLL_GetDivider();
    RCC_OscInitStruct->PLL.PLLN      = LL_RCC_PLL_GetN();
    RCC_OscInitStruct->PLL.PLLP      = LL_RCC_PLL_GetP();
    RCC_OscInitStruct->PLL.PLLQ      = LL_RCC_PLL_GetQ();
    RCC_OscInitStruct->PLL.PLLR      = LL_RCC_PLL_GetR();
  }
}

/**
  * @brief  Configure the RCC_ClkInitStruct according to the internal
  *         RCC configuration registers.
  * @param  RCC_ClkInitStruct Pointer to a @ref RCC_ClkInitTypeDef structure that
  *                           will be configured.
  * @param  pFLatency         Pointer to the Flash Latency variable.
  * @retval None
  */
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t *pFLatency)
{
  /* Check the parameters */
  if ((RCC_ClkInitStruct != NULL) && (pFLatency != NULL))
  {
    /* Set all possible values for the Clock type parameter --------------------*/
    RCC_ClkInitStruct->ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 \
                                    | RCC_CLOCKTYPE_PCLK2  | RCC_CLOCKTYPE_HCLK3);
#if defined(DUAL_CORE)
    RCC_ClkInitStruct->ClockType |= RCC_CLOCKTYPE_HCLK2;
#endif

    /* Get the SYSCLK configuration --------------------------------------------*/
    RCC_ClkInitStruct->SYSCLKSource = LL_RCC_GetSysClkSource();

